{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Bachelor of Engineering",
      "department": "Electrical and Computer Engineering",
      "duration": "2016-2021",
      "school_name": "Ryerson university"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_KarinaShrestha",
  "highlighted_projects": [
    {
      "description": "Utilized Python (scikit-learn, numpy, pandas, matlplotlib) to perform data preprocessing and implement supervised machine learning techniques to predict downlink throughput based on various QoS metrics of a dataset and analyze performance based on the location of data collection.",
      "name": "Throughput Predictor for a 4G LTE Network"
    },
    {
      "description": "Utilized C to develop a peer-to-peer network application based on TCP and UDP socket communication to allow multiple clients to display, upload, and download content.",
      "name": "P2P Application"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a Linux Cluster Monitoring Agent that manages a cluster of Linux nodes/hosts that run on CentOS7. The connection between the hosts are enabled through a network switch and communication is accomplished via internal IPv4 addresses. Using Docker containers, a PostgreSQL database instance was provisioned to persist hardware and resource usage data in real-time through bash scripts. A few SQL queries were created to analyze the data and answer business questions related to better managing the cluster planning for future recourses.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Designed a Twitter command-line application that allows users to post, show, or delete a tweet using the Twitter REST API. Utilizes OAuthConsumer, HttpClient, and Jackson libraries for user authentication/object serialization. Implemented the Spring framework to manage dependencies, JUnit/Mockito for testing, and Docker to deploy the app.",
        "JDBC App: Implemented an application that leverages JDBC to connect to a dockerized PostgreSQL database, allowing users to perform CRUD operations on the data. The functionality of the app is based on the DAO pattern.",
        "Grep App: Developed a Java application that simulates the functionality of the Linux/Unix grep command-line tool which allows users to search for matching strings within a file, given three arguments. Utilizes Lambda \u0026 Stream APIs to optimize performance and memory usage. The app was packaged by Maven and the dockerized image of the project was deployed to DockerHub."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Karina Shrestha ",
  "others": [
    {
      "bullets": [
        "Hiking and swimming",
        "Baking",
        "Art"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Collaborated with a small team of data engineers in an Agile/Scrum development environment. Led and participated in daily scrum meetings during two-week sprints. Developed software projects using various technologies including Docker, Maven, PostgreSQL, and Git to adapt to current industry trends",
      "duration": "July 2021 - present",
      "title": "Data Engineer"
    },
    {
      "company": "Alpha Coding",
      "description": "Lead programming classes and teach students of all ages in Python, Robotics, Java, Tinkercad, Minecraft, MIT App Inventor and Scratch. Continually create and develop the curriculum, lesson plans/materials. Work with students to develop their own individual learning path and track their progress",
      "duration": "September 2019 - present",
      "title": "Coding Instructor"
    }
  ],
  "skills": {
    "competent": [
      "C",
      "Machine Learning",
      "Maven",
      "Docker",
      "Computer Networks",
      "C++"
    ],
    "familiar": [
      "JavaScript",
      "HTML/CSS",
      "JUnit",
      "REST API",
      "Scala"
    ],
    "proficient": [
      "Java",
      "Python",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I am a recent graduate with a Bachelor of Engineering specializing in Computer Engineering from Ryerson University. During my undergraduate career, I gained a solid understanding of algorithms and data structures. The courses and projects that I completed especially piqued my interest in data engineering and machine learning. It has also helped me to become adept at adapting to different technologies and programming languages, a strong problem-solver, and a big advocate for new challenges. Currently as a Data Engineer at Jarvis, I have had the opportunity to develop various software projects to further my knowledge of database systems, the latest tools and technologies such as Java, Docker, REST APIs, and Git. I am passionate about working on projects that require me to explore areas outside of my comfort, as continuing to learn new languages and technologies are important to me."
}
